{
  "backend/main.mo": "Motoko canister managing user profiles with authorization checks and storing contact form messages, including admin-only message retrieval.",
  "feature_evidence.json": "Feature evidence report linking the content editing guide to relevant components and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing major frontend files and components.",
  "frontend/CONTENT_EDITING_GUIDE.md": "Developer guide explaining how to edit site text, images, menu items, and configuration-based content.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH variables for light and dark mode UI styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for all main pages wrapped in the site layout.",
  "frontend/src/components/about/StorySection.tsx": "Renders the About page story content with styled sections and a closing quote.",
  "frontend/src/components/boosters/ComboBanner.tsx": "Config‑controlled dismissible promo banner linking to an offer.",
  "frontend/src/components/boosters/EmbedsSection.tsx": "Optional Instagram and Google Reviews embed section driven by boostersConfig toggles.",
  "frontend/src/components/boosters/StudentDiscountBadge.tsx": "Shows a student discount badge when enabled in boostersConfig.",
  "frontend/src/components/contact/ContactForm.tsx": "Form that submits contact messages via canister mutation with validation and success/error states.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Responsive grid displaying café gallery images with hover zoom and soft shadows.",
  "frontend/src/components/home/AtmosphereMasonry.tsx": "Displays a 3‑image masonry-style gallery with captions and styling.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero with background image, tagline, description, and CTA buttons.",
  "frontend/src/components/home/LocationHours.tsx": "Shows an embedded map plus address, hours, and a directions button.",
  "frontend/src/components/home/SignatureDishesGrid.tsx": "Shows a grid of featured dishes with images, taglines, and a link to the full menu.",
  "frontend/src/components/home/SocialProofStrip.tsx": "Displays a star-rating strip with short customer review quotes.",
  "frontend/src/components/home/TestimonialsSlider.tsx": "Implements a testimonial carousel with navigation and author attribution.",
  "frontend/src/components/home/WhyPeopleLoveUs.tsx": "Lists four highlighted reasons to visit, each with an icon and description.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, contact info, social links, hours, and copyright.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the page with a sticky header, main content outlet, and footer.",
  "frontend/src/components/layout/StickyHeader.tsx": "Provides a responsive header with logo, navigation links, CTAs, and a mobile menu.",
  "frontend/src/components/menu/MenuCategorySection.tsx": "Displays a menu category with title, optional description, and a grid of item cards.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Renders a styled card showing a menu item's image, badges, name, price, and description.",
  "frontend/src/config/boostersConfig.ts": "Defines configuration for promotional boosters like combo banners, student discounts, and embeds.",
  "frontend/src/config/siteConfig.ts": "Holds site-wide metadata including name, contact info, social links, hours, and location settings.",
  "frontend/src/data/menuData.ts": "Provides menu category and item definitions with details like descriptions, prices, images, and badges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using React Query, updating it when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "Exposes a mutation for creating contact messages using the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, color variables, typography, and utility classes.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page layout with a title and the StorySection component.",
  "frontend/src/pages/ContactPage.tsx": "Shows a contact form, contact details, quick action buttons, and an embedded map.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery page with a header and the GalleryGrid component.",
  "frontend/src/pages/HomePage.tsx": "Composes the homepage layout by rendering a sequence of promotional and content sections including hero, social proof, dishes, testimonials, and location info.",
  "frontend/src/pages/MenuPage.tsx": "Renders the menu page with a header, student discount badge, and a list of menu categories sourced from menuData.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, persist, and clear URL or session-based parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including colors, typography, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, and existing feature specifications for the luxury cafe website."
}